[
    {
        "if": {},
        "result": {},
        "role": "recipients",
        "origin": "Since there is no predefined limit to the length of a payload, recipients MUST anticipate potentially large decimal numerals and prevent parsing errors due to integer conversion overflows."
    },
    {
        "if": {
            "exist": "Accept"
        },
        "result": {},
        "role": "server",
        "origin": "An origin server that supports byte-range requests for a given target resource MAY send Accept-Ranges: bytes to indicate what range units are supported."
    },
    {
        "if": {
            "exist": "Accept",
            "not_exists": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "A server that does not support any kind of range request for the target resource MAY send Accept-Ranges: none to advise the client not to attempt a range request."
    },
    {
        "if": {
            "not_exists": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "A server MAY ignore the Range header field."
    },
    {
        "if": {
            "not_exists": "Range",
            "multiple": "method"
        },
        "result": {},
        "role": "server",
        "origin": "A server MUST ignore a Range header field received with a request method other than GET."
    },
    {
        "if": {
            "not_exists": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "An origin server MUST ignore a Range header field that contains a range unit it does not understand."
    },
    {
        "if": {
            "not_exists": "Range"
        },
        "result": {},
        "role": "proxy",
        "origin": "A proxy MAY discard a Range header field that contains a range unit it does not understand."
    },
    {
        "if": {
            "multiple": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "A server that supports range requests MAY ignore or reject a Range header field that consists of more than two overlapping ranges, or a set of many small ranges that are not listed in ascending order, since both are indications of either a broken client or a deliberate denial-of-service attack (Section 6.1)."
    },
    {
        "if": {},
        "result": {},
        "role": "client",
        "origin": "A client SHOULD NOT request multiple ranges that are inherently less efficient to process and transfer than a single range that encompasses the same data."
    },
    {
        "if": [],
        "result": [
            {}
        ],
        "role": "server",
        "origin": "If all of the preconditions are true, the server supports the Range header field for the target resource, and the specified range(s) are invalid or unsatisfiable, the server SHOULD send a 416 (Range Not Satisfiable) response."
    },
    {
        "if": {
            "exist": "HTTP-date"
        },
        "result": {},
        "role": "client",
        "origin": "If-Range = entity-tag / HTTP-date A client MUST NOT generate an If-Range header field in a request that does not contain a Range header field."
    },
    {
        "if": {
            "exist": "Range",
            "not_exists": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "A server MUST ignore an If-Range header field received in a request that does not contain a Range header field."
    },
    {
        "if": {
            "not_exists": "If-Range"
        },
        "result": {},
        "role": "server",
        "origin": "An origin server MUST ignore an If-Range header field received in a request for a target resource that does not support Range requests."
    },
    {
        "if": {
            "not_exists": "If-Range"
        },
        "result": {},
        "role": "client",
        "origin": "A client MUST NOT generate an If-Range header field containing an entity-tag that is marked as weak."
    },
    {
        "if": {
            "not_exists": "HTTP-date"
        },
        "result": {},
        "role": "client",
        "origin": "A client MUST NOT generate an If-Range header field containing an HTTP-date unless the client has no entity-tag for the corresponding representation and the date is a strong validator in the sense defined by Section 2.2.2 of [RFC7232]."
    },
    {
        "if": [],
        "result": [],
        "role": "server",
        "origin": "If the validator does not match, the server MUST ignore the Range header field."
    },
    {
        "if": [],
        "result": [
            {
                "status_code": "206"
            }
        ],
        "role": "server",
        "origin": "If a single part is being transferred, the server generating the 206 response MUST generate a Content-Range header field, describing what range of the selected representation is enclosed, and a payload consisting of the range."
    },
    {
        "if": [],
        "result": [],
        "role": "server",
        "origin": "If multiple parts are being transferred, the server generating the 206 response MUST generate a \"multipart/byteranges\" payload, as defined in Appendix A, and a Content-Type header field containing the multipart/byteranges media type and its required boundary parameter."
    },
    {
        "if": {
            "not_exists": "Content-Range",
            "multiple": "response"
        },
        "result": {},
        "role": "server",
        "origin": "To avoid confusion with single-part responses, a server MUST NOT generate a Content-Range header field in the HTTP header section of a multiple part response (this field will be sent in each part instead)."
    },
    {
        "if": [
            {
                "exist": "Content-Type"
            }
        ],
        "result": [],
        "role": "server",
        "origin": "If the selected representation would have had a Content-Type header field in a 200 (OK) response, the server SHOULD generate that same Content-Type field in the header area of each body part."
    },
    {
        "if": {
            "exist": "Range",
            "multiple": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "When multiple ranges are requested, a server MAY coalesce any of the ranges that overlap, or that are separated by a gap that is smaller than the overhead of sending multiple parts, regardless of the order in which the corresponding byte-range-spec appeared in the received Range header field."
    },
    {
        "if": {},
        "result": {},
        "role": "server",
        "origin": "A server MUST NOT generate a multipart response to a request for a single range, since a client that does not request multiple parts might not support multipart responses."
    },
    {
        "if": [
            {}
        ],
        "result": [],
        "role": "server",
        "origin": "However, a server MAY generate a multipart/byteranges payload with only a single body part if multiple ranges were requested and only one range was found to be satisfiable or only one range remained after coalescing."
    },
    {
        "if": {},
        "result": {},
        "role": "client",
        "origin": "A client that cannot process a multipart/byteranges response MUST NOT generate a request that asks for multiple ranges."
    },
    {
        "if": {
            "exist": "Range",
            "multiple": "Range"
        },
        "result": {},
        "role": "server",
        "origin": "When a multipart response payload is generated, the server SHOULD send the parts in the same order that the corresponding byte-range-spec appeared in the received Range header field, coalesced into other ranges."
    },
    {
        "if": {
            "exist": "Content-Range",
            "multiple": "Content-Range"
        },
        "result": {},
        "role": "client",
        "origin": "A client that receives a multipart response MUST inspect the Content-Range header field present in each body part in order to determine which range is contained in that body part; a client cannot rely on receiving the same ranges that it requested, nor the same order that it requested."
    },
    {
        "if": [
            {
                "exist": "If-Range"
            }
        ],
        "result": [],
        "role": "sender",
        "origin": "If a 206 is generated in response to a request with an If-Range header field, the sender SHOULD NOT generate other representation header fields beyond those required above, because the client is understood to already have a prior response containing those header fields."
    },
    {
        "if": [],
        "result": [],
        "role": "client",
        "origin": "If all of the matching stored responses are 206 responses, then the stored response with the most recent header fields is used as the source of header fields for the combined response, except that the client MUST use other header fields provided in the new response, aside from Content-Range, to replace all instances of the corresponding header fields in the stored response."
    },
    {
        "if": [
            {
                "exist": "Content-Range"
            },
            {
                "exist": "Content-Range",
                "multiple": "Content-Range"
            }
        ],
        "result": [
            {
                "status_code": "200"
            }
        ],
        "role": "client",
        "origin": "Otherwise, the client MUST process the set of continuous ranges as one of the following: an incomplete 200 (OK) response if the combined response is a prefix of the representation, a single 206 (Partial Content) response containing a multipart/byteranges body, or multiple 206 (Partial Content) responses, each with one continuous range that is indicated by a Content-Range header field."
    }
]